{"schema":6,"addons":[{"id":"savepage-we@DW-dev","icons":{"32":"https://addons.mozilla.org/user-media/addon_icons/724/724283-32.png?modified=f79057df","64":"https://addons.mozilla.org/user-media/addon_icons/724/724283-64.png?modified=f79057df","128":"https://addons.mozilla.org/user-media/addon_icons/724/724283-128.png?modified=f79057df"},"name":"Save Page WE","version":"28.11","sourceURI":"https://addons.mozilla.org/firefox/downloads/file/4091842/save_page_we-28.11.xpi","homepageURL":null,"supportURL":null,"amoListingURL":"https://addons.mozilla.org/en-US/firefox/addon/save-page-we/","description":"Save a complete web page (as currently displayed) as a single HTML file that can be opened in any browser. Save a single page, multiple selected pages or a list of page URLs. Automate saving from command line.","fullDescription":"CHANGES\n\nVersion 28.11\n\n• Automatically selects the original or new save method.\n• Minor bug fix.\n\nOVERVIEW\n\nSave Page WE provides a simple facility to save a web page (as currently displayed) as a single HTML file that can be opened in any browser. The saved page is a highly accurate representation of the original page. Multiple pages can be saved either by selecting multiple tabs or by loading a list of page URLs.\n\nSave Page WE is implemented using the WebExtensions API and is available for both Firefox and Chrome with identical functions and user interfaces.\n\nIf used with Print Edit WE, Save Page WE now requires Print Edit WE 26.1 or later for full compatibility.\n\nOPTIONS PAGE\n\nThe Save Page WE Options page can be accessed as follows:\n\n• Firefox - Right-click on the toolbar button, select Manage Extension, click on the ••• button and select Options.\n\n• Chrome - Right-click on the toolbar button, and then select Options.\n\nTOOLBAR BUTTON\n\nAfter installation of Save Page WE, there will be a new blue 'floppy-disk' button on the main toolbar.\n\nTo save the web pages in all of the currently selected tabs file, just click on the Save Page WE toolbar button.\n\nThere are options to set the button action as:\n\n• Save Selected Tabs (Basic, Standard or Custom Items)\n• Save Listed URLs (Basic, Standard or Custom Items)\n\nThere is an option to prompt the user to enter comments when saving the file.\n\nThere is an option to use the new save method, which can save more pages (see the 'Save Methods' section below).\n\nThere is an option to always show the 'Save As' dialog box when saving a page using the new save method. If this option is not enabled, the 'Save As' dialog box will only be shown if the Firefox 'Downloads' option is set to 'Always ask you where to save files'.\n\nThere is an option to delay the start of saving until several seconds after the initial page load event, which can be useful with pages that display delayed search results.\n\nThere is an option to close the tab after saving a page.\n\nThere are options to specify the format of the saved file name. See the 'Saved File Name' section below.\n\nBy default the saved HTML file will have a '.html' extension.\n\nCONTEXT MENU & BUTTON MENU\n\nTo save a web page as an HTML file, or to perform operations on a previously saved page, right-click on the page contents to open the context menu, select the 'Save Page WE' sub-menu, and then select one of the menu items:\n\n• Save Selected Tabs\n     - Basic, Standard or Custom Items\n     - Basic, Standard or Custom Items with or without Scroll/Shrink\n• Save Listed URLs\n     - Basic, Standard or Custom Items\n     - Basic, Standard or Custom Items with or without Scroll/Shrink\n• Cancel Save\n• View Saved Page Info\n• Remove Resource Loader\n• Extract Image/Audio/Video\n\nAlternatively, right-click on the Save Page WE toolbar button to open the button menu, and then select one of the menu items.\n\nThere is an option to show/hide the Save Page WE submenu item on the context menu.\n\nNote, the 'Remove Resource Loader' menu item is only shown when viewing a page saved by Save Page WE 15.1 or earlier.\n\nNote, the 'Extract Image/Audio/Video' menu item is only shown on the context menu when right-clicking on images in saved pages.\n\nKEYBOARD SHORTCUTS\n\nTo save a web page as an HTML file, press Alt+A.\n\nTo cancel a single or multiple page save, press Alt+C.\n\nThese shortcuts can be reconfigured in the Shortcuts tab of the Save Page WE Options page.\n\nSAVING MULTIPLE PAGES\n\nThere are two ways to save multiple pages:\n\n• Highlight multiple tabs and then select the 'Save Selected Tabs' menu item.\n• Load a file containing a list of URLs in the Zoom Page WE Options dialog and then select the 'Save Listed URLs' menu item.\n\nWhen saving multiple pages, tabs are switched to foreground if the load lazy content option is enabled.\n\nSAVED ITEMS\n\nSave Basic Items - saves these items:\n\n• HTML elements\n• HTML image files (currently displayed)\n• HTML canvas graphics\n• CSS style sheets\n• CSS image files (currently displayed)\n• CSS font files (used by this browser)\n\nSave Standard Items - saves the Basic Items and these items:\n\n• HTML image files (all)\n• HTML audio & video files\n• HTML object & embed files\n• CSS font files (woff for any browser)\n\nSave Custom Items - saves the Basic Items and the items selected from this list:\n\n• HTML image files (all)\n• HTML audio & video files\n• HTML object & embed files\n• CSS image files (all)\n• CSS font files (woff for any browser)\n• CSS font files (all)\n• Scripts (in same-origin frames)\n\nNote, scripts in cross-origin frames are never saved.\n\nThere is an option to load lazy content using two alternative methods: Scroll Page or Shrink Page.\n\nThere is an option to load lazy images in existing content.\n\nThere is an option to retain cross-origin frames when saving the page. Note, cross-origin iframes often contain adverts or visitor comments.\n\nThere is an option to merge duplicate CSS images (to reduce the saved file size).\n\nThere is an option to allow saved scripts to execute (by default scripts are not allowed to execute).\n\nThere are options to remove or rehide elements hidden by the page itself or by other extensions, such as page editors (e.g Print Edit WE) or content blockers (e.g. uBlock Origin).\n\nThere is an option to include an information bar at the top of the saved page.\n\nThere is an option to include metrics and resource summary in the saved file.\n\nThere is an option to set the maximum depth of saved nested frames/iframes.\n\nSAVED FILE NAME\n\nThere is an option to specify the format of the saved file name.\n\nThis format is used when saving the complete page and when extracting a resource (Image/Audio/Video).\n\nThe saved file name may contain the following predefined fields:\n\n• %TITLE% - (saving page) the document title, or if missing same as %FILE%.\n• %TITLE% - (extracting resource) the same as %FILE%.\n• %DATE(x)% - saved date in YYYYxMMxDD format, 'x' is optional separator.\n• %TIME(x)% - saved time in HHxMMxSS format, 'x' is optional separator.\n• %DATEP(x)% - published date in YYYYxMMxDD format, 'x' is optional separator.\n• %TIMEP(x)% - published time in HHxMMxSS format, 'x' is optional separator.\n• %DATEPF(x)% - same as %DATEP(x)%, or if missing falls back to saved date.\n• %TIMEPF(x)% - same as %TIMEP(x)%, or if missing falls back to saved time.\n• %HOST% - host name in URL.\n• %HOSTW% - same as %HOST%, but without 'www.' prefix.\n• %PATH% - path name in URL.\n• %PATHW% - same as %PATH%, but without '.extension' suffix.\n• %FILE% - file name in the last segment of URL path.\n• %FILEW% - same as %FILE%, but without '.extension' suffix.\n• %QUERY(p)% - query string in URL if 'p' omitted, else value of parameter 'p'.\n• %FRAGMENT% - fragment string in URL.\n\nThere are options to replace spaces in the saved file name with a user-defined character and to set the maximum length of the saved file name.\n\nSAVE METHODS\n\nBelow are some important details about the new and old save methods.\n\nOld Save Method:\n\n• The default in Version 18.0 or earlier.\n• Remembers the last save location in both Firefox and Chrome.\n• Cannot save a few pages (e.g Yahoo) in Chrome 84 or later.\n• In which case the save will fail without any error messages.\n• Use the new save method for these pages.\n\nNew Save Method:\n\n• The default in Version 19.0. Optional in Version 20.0 or later.\n• Remembers the last save location in Firefox 78 or later, but not in Chrome.\n• Can save all pages.\n• Other download extensions may change the saved file name to a UUID.\n• For example \"9bd65c08-5f1c-491c-bf61-63d90638bf9e.html\".\n• In which case try uninstalling and reinstalling Save Page WE.\n• Or use the old save method.\n\nCONFIGURING FIREFOX\n\nGo to Firefox Main Menu > Tools > Options > General.\n\nIn the Applications section, set the action for the 'Firefox HTML Document' content type:\n\n• Always ask - the 'What should Firefox do with this file?' dialog box will be shown.\n• Use Firefox - the saved file will be opened in Firefox.\n• Save File - the action depends on the settings in the Downloads section.\n\nIn the Downloads section, set the 'Save files to' folder location, and enable or disable the 'Always ask you where to save files' option.\n\nLOADING RESOURCES\n\nThere is an option to set the maximum time allowed for loading a Listed URL page or for loading any page when using automation.\n\nThere is an option to set the maximum size allowed for large or repeatedly referenced resources.\n\nThere is an option to set the maximum time allowed for loading individual resources.\n\nThere is an option to allow loading of passive mixed content (image,audio,video).\n\nThere is an option to send a referer header when requesting a resource. The options are: do not send a refer header, send a referer header with origin only, or send a referer header with origin and path (origin only in private browsing).\n\nUNSAVED RESOURCES\n\nThere is an option to show a warning if any resources cannot be saved.\n\nThere is an option to show a list of all resources that cannot be saved.\n\nThere is an option to remove URLs of unsaved resources, which avoids unsaved resources being loaded from the internet when the saved page is opened.\n\nUSING AUTOMATION\n\nThere is an option to use automation mode, allowing a page to be saved from the command line.\n\nIf this option is enabled:\n\n• When Firefox starts, Save Page WE will be automatically initiated using the current Button Action.\n• When the save operation is complete, Firefox will be automatically closed.\n\nTo exit automation mode, immediately after Firefox starts up, use the 'Cancel Save' menu command or keyboard shortcut to cancel the save operation, and then disable the option to use automation.\n\nIf the Button Action is set to Save Selected Tabs, then all tabs are saved when the use automation option is enabled.\n\nThe new saved method is always used when the use automation option is enabled.\n\nSAVED FILE FORMAT\n\nThe HTML elements (as currently displayed) and all of the referenced resources are saved in a single file (.html).\n\nExternal CSS style sheets are converted to internal CSS style sheets. Frame contents and external scripts are stored as UTF-8 data URIs in the 'src' attribute. Iframe contents are stored as UTF-8 text in the 'srcdoc' attribute.\n\nAll binary resources (images, fonts, audios, videos, etc) are stored as Base64 data URIs. CSS images referenced multiple times within a frame will only be stored once in that frame. CSS fonts and HTML images/audios/videos will be stored once for each reference.\n\nNote that not all cross-origin frames can be saved. A cross-origin frame will be saved only if all of its cross-origin ancestor frames can run content scripts. Scripts in cross-origin frames are not saved.\n\nThere is an option to format the HTML source code in the saved file.\n\nCONVERSION OF MAF AND UnMHT FILES (.maff & .mht)\n\nIt is not possible for Save Page WE to do an automatic conversion of a Mozilla Archive Format (.maff or .mht) file or an UnMHT (.mht) file into a Save Page WE (.html) file. Firefox WebExtensions add-ons, such as Save Page WE, are not allowed to read local files.\n\nIt is recommended to convert .maff/.mht files as follows:\n\n• Open the saved .maff/.mht file in Firefox.\n• Re-save as .htm file (+ resources folder) using Firefox’s “Save Page As...” (Web Page, complete).\n• Serve the saved .htm file (+ resources folder) through a local web server and open in Firefox.\n• Re-save using Save Page WE.\n\nWith regards to a local web server, it is suggested using a Google Chrome App called “Web Server for Chrome” available from the Chrome Web Store: https://chrome.google.com/webstore/detail/web-server-for-chrome/ofhbbkphhbklhfoeikjpcbhemlocgigb\n\nNote that, using Firefox 56 and Mozilla Archive Format 5.2.0, it is possible to do a bulk conversion of .maff/.mht files to .htm files (+ resources folders), as described here: http://maf.mozdev.org/index.html.\n\nSUPPORT\n\nPlease e-mail: dw-dev@gmx.com\n\nLICENSE\n\nDistributed under the GNU General Public License version 2.\nSee LICENCE.txt file and http://www.gnu.org/licenses/","weeklyDownloads":493,"type":"extension","creator":{"name":"DW-dev","url":"https://addons.mozilla.org/en-US/firefox/user/1236621/"},"developers":[],"screenshots":[{"url":"https://addons.mozilla.org/user-media/previews/full/212/212354.png?modified=1622132503","width":1000,"height":750,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/212/212354.jpg?modified=1622132503","thumbnailWidth":533,"thumbnailHeight":400,"caption":"Save Page WE - toolbar button"},{"url":"https://addons.mozilla.org/user-media/previews/full/212/212355.png?modified=1622132505","width":1000,"height":750,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/212/212355.jpg?modified=1622132505","thumbnailWidth":533,"thumbnailHeight":400,"caption":"Save Page WE - toolbar button menu"},{"url":"https://addons.mozilla.org/user-media/previews/full/212/212356.png?modified=1622132506","width":1000,"height":750,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/212/212356.jpg?modified=1622132506","thumbnailWidth":533,"thumbnailHeight":400,"caption":"Save Page WE - context menu sub-menu"},{"url":"https://addons.mozilla.org/user-media/previews/full/212/212357.png?modified=1622132508","width":1000,"height":749,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/212/212357.jpg?modified=1622132508","thumbnailWidth":533,"thumbnailHeight":399,"caption":"Save Page WE - ready to save page"},{"url":"https://addons.mozilla.org/user-media/previews/full/212/212358.png?modified=1622132510","width":1000,"height":750,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/212/212358.jpg?modified=1622132510","thumbnailWidth":533,"thumbnailHeight":400,"caption":"Save Page WE - view saved page info"},{"url":"https://addons.mozilla.org/user-media/previews/full/212/212359.png?modified=1622132512","width":1000,"height":750,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/212/212359.jpg?modified=1622132512","thumbnailWidth":533,"thumbnailHeight":400,"caption":"Save Page WE - extract image/audio/video"},{"url":"https://addons.mozilla.org/user-media/previews/full/212/212360.png?modified=1622132514","width":1000,"height":750,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/212/212360.jpg?modified=1622132514","thumbnailWidth":533,"thumbnailHeight":400,"caption":"Save Page WE - options page - general tab"},{"url":"https://addons.mozilla.org/user-media/previews/full/212/212361.png?modified=1622132516","width":1000,"height":750,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/212/212361.jpg?modified=1622132516","thumbnailWidth":533,"thumbnailHeight":400,"caption":"Save Page WE - options page - saved items tab"},{"url":"https://addons.mozilla.org/user-media/previews/full/212/212362.png?modified=1622132518","width":1000,"height":750,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/212/212362.jpg?modified=1622132518","thumbnailWidth":533,"thumbnailHeight":400,"caption":"Save Page WE - options page - advanced tab"}],"contributionURL":"","averageRating":4.3616,"reviewCount":246,"reviewURL":"https://addons.mozilla.org/en-US/firefox/addon/save-page-we/reviews/","updateDate":1680687385000},{"id":"firefox@tampermonkey.net","icons":{"32":"https://addons.mozilla.org/user-media/addon_icons/683/683490-32.png?modified=1625638973","64":"https://addons.mozilla.org/user-media/addon_icons/683/683490-64.png?modified=1625638973","128":"https://addons.mozilla.org/user-media/addon_icons/683/683490-128.png?modified=1625638973"},"name":"Tampermonkey","version":"5.3.3","sourceURI":"https://addons.mozilla.org/firefox/downloads/file/4405733/tampermonkey-5.3.3.xpi","homepageURL":"https://tampermonkey.net","supportURL":"https://tampermonkey.net/faq","amoListingURL":"https://addons.mozilla.org/en-US/firefox/addon/tampermonkey/","description":"Tampermonkey is the world's most popular userscript manager.","fullDescription":"Tampermonkey is the most popular userscript manager, with over 10 million weekly users. It's available for Chrome, Microsoft Edge, Safari, Opera Next and Firefox.\n\nTampermonkey makes it very easy to manage your userscripts and provides features like a clear overview over the running scripts, a built-in editor, ZIP-based import and export (Google Drive, Dropbox, OneDrive), automatic update checks and also browser and cloud storage based synchronization. And finally it's compatible to Greasemonkey up to version 3.x with experimental 4.x support.\n\nNote: If you want to install the more often updated BETA version, then you can get it from here: https://tampermonkey.net/?browser=firefox","weeklyDownloads":22434,"type":"extension","creator":{"name":"Jan Biniok","url":"https://addons.mozilla.org/en-US/firefox/user/11993838/"},"developers":[],"screenshots":[{"url":"https://addons.mozilla.org/user-media/previews/full/170/170870.png?modified=1622132485","width":634,"height":525,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/170/170870.jpg?modified=1622132485","thumbnailWidth":483,"thumbnailHeight":400,"caption":"Tampermonkey's built-in editor"}],"contributionURL":"","averageRating":4.6964,"reviewCount":895,"reviewURL":"https://addons.mozilla.org/en-US/firefox/addon/tampermonkey/reviews/","updateDate":1734704400000},{"id":"{732216ec-0dab-43bb-ac85-4b5e1977599d}","icons":{"32":"https://addons.mozilla.org/user-media/addon_icons/963/963216-32.png?modified=9e1f8345","64":"https://addons.mozilla.org/user-media/addon_icons/963/963216-64.png?modified=9e1f8345","128":"https://addons.mozilla.org/user-media/addon_icons/963/963216-128.png?modified=9e1f8345"},"name":"Surfshark VPN Extension","version":"4.23.0","sourceURI":"https://addons.mozilla.org/firefox/downloads/file/4394679/surfshark_vpn_proxy-4.23.0.xpi","homepageURL":"https://surfshark.com","supportURL":"https://support.surfshark.com","amoListingURL":"https://addons.mozilla.org/en-US/firefox/addon/surfshark-vpn-proxy/","description":"Browse the web freely with secure, private internet access for the Firefox browser extension.","fullDescription":"The Surfshark VPN browser extension for Mozilla Firefox uses a secure proxy to allow seamless web browsing, unrestricted internet access, and 24/7 online protection.\n\nWith our Firefox extension, you can stream global content safely. Our strict no-logs policy and vast server infrastructure ensure your security while providing lightning-fast speeds!\n\nWhy you should try the Surfshark browser extension:\n\n✔️ VAST SERVER INFRASTRUCTURE:\nOur network is safe and fast with 100+ locations and 3200+ servers supporting 10 GBit connection and versatile protocols, including WireGuard, OpenVPN, and IKEv2!\n\n✔️ SINGLE ACCOUNT, UNLIMITED DEVICES:\nYour Surfshark VPN works on an unlimited number of devices simultaneously. Protect your entire household with our browser extensions and apps on mobile, desktop, TVs, and more!\n\n✔️ INDEPENDENTLY AUDITED:\nSurfshark is one of the few VPN providers that has been independently audited. Cure53 approved our server infrastructure, while Deloitte verified our no-logs statement.\n\n✔️ STRICT NO-LOGS POLICY:\nWe don't track what you do or where you go connected to our VPN. Our no-activity-logs policy is independently audited and approved by a third-party auditing firm.\n\n✔️ NEW IDENTITY WITH ALTERNATIVE ID:\nGenerate a brand-new online profile with a real address and an email using our Alternative ID tool. Use it to keep your true identity under wraps on websites you don’t fully trust.\n\n✔️ FREE WEB ACCESS:\nWe believe the internet should be limitless and border-free. With our extension, you can safely access global content and apps.\n\n✔️ ROBUST PRIVACY MEASURES:\nOur VPN connections are encrypted with industry-leading AES-256-GCM encryption. It ensures your data is secure and protected from cyberthreats, making your online presence private.\n\n✔️ COOKIE POP-UP BLOCKER:\nCookie consent pop-ups are annoying. But our browser extension will sort them out before they appear on your screen. We automatically decline or accept the necessary ones.\n\n✔️ ADS & TRACKERS BLOCKER:\nSay goodbye to online ads and trackers with our CleanWeb feature. Our browser extension’s built-in ad blocker keeps your surfing squeaky clean!\n\n✔️ MALWARE ALERT & BLOCKER:\nCleanWeb works in the background and alerts you about malware-infected websites. It blocks threats before they can load and affect your device.\n\n✔️ WEBSITE BYPASSER:\nSometimes you may want to access a website without a VPN, and we've got you covered! With Bypasser, you can choose which websites or IP addresses will use VPN and which won't.\n\n✔️ DATA BREACH ALERT:\nEveryone should know if the website they're visiting has been subject to a data breach. Our extension notifies you about all data leaks the website has suffered.\n\n✔️ SAFE SEARCH FEATURE:\nOur Search feature lets you ask questions without being tracked, monitored, or logged. It's a purely private search built right into the extension.\n\n✔️ 24/7 CUSTOMER SUPPORT:\nWe are always ready to assist you with any questions you may have. We aim to resolve issues quickly and efficiently via live chat or email.\n\nUseful info & links:\n\nHelp is available 24/7 via live chat on our website or at support@surfshark.com\nPrivacy Policy: https://surfshark.com/privacy-policy\nTerms & Conditions: https://surfshark.com/terms-of-service\nWarrant canary: https://surfshark.com/warrant-canary","weeklyDownloads":3686,"type":"extension","creator":{"name":"Surfshark","url":"https://addons.mozilla.org/en-US/firefox/user/13932238/"},"developers":[],"screenshots":[{"url":"https://addons.mozilla.org/user-media/previews/full/300/300629.png?modified=1718097464","width":1280,"height":800,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/300/300629.jpg?modified=1718097464","thumbnailWidth":533,"thumbnailHeight":333,"caption":"High-Speed VPN."},{"url":"https://addons.mozilla.org/user-media/previews/full/300/300630.png?modified=1718097464","width":1280,"height":800,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/300/300630.jpg?modified=1718097464","thumbnailWidth":533,"thumbnailHeight":333,"caption":"Over 100 server locations available."},{"url":"https://addons.mozilla.org/user-media/previews/full/300/300631.png?modified=1718097464","width":1280,"height":800,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/300/300631.jpg?modified=1718097464","thumbnailWidth":533,"thumbnailHeight":333,"caption":"Identity protection with Alternative-ID."},{"url":"https://addons.mozilla.org/user-media/previews/full/300/300632.png?modified=1718097464","width":1280,"height":800,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/300/300632.jpg?modified=1718097464","thumbnailWidth":533,"thumbnailHeight":333,"caption":"Ad-blocker and Data Breach functionality."}],"contributionURL":"","averageRating":3.5775,"reviewCount":349,"reviewURL":"https://addons.mozilla.org/en-US/firefox/addon/surfshark-vpn-proxy/reviews/","updateDate":1733246038000}]}